[
  {
    "name": "This Blog",
    "description": "A place to showcase what I am working on, and learning",
    "coverImageUrl": "http://image.com",
    "tags": [
      "react",
      "ssr",
      "remix"
    ],
    "caseStudyUrl": "link to article on this project",
    "related": [
      "array",
      "of related",
      "articles"
    ],
    "content": "\nThis is a sample project file, where I can write about projects I have completed. It is super important to remember that I am working hard on presenting this data well, and to be employable.\n\n## Introduction\n\nThe first step is a strong introduction.\n\n## Outline\n\n-   Problem\n-   Solution\n-   Difficulties\n-   Overcome\n-   Conclusion\n",
    "slug": "this-blog",
    "tech": [
      "react",
      "ssr",
      "remix",
      "nodejs",
      "typescript"
    ]
  },
  {
    "name": "BookWorm Digital Library",
    "description": "Explore and borrow an extensive collection of digital books, audio, and more",
    "coverImageUrl": "http://image.com/bookworm",
    "tags": [
      "angular",
      "firebase",
      "material-ui",
      "typescript",
      "nodejs"
    ],
    "caseStudyUrl": "link to article on BookWorm project",
    "related": [
      "array",
      "of related",
      "articles",
      "about BookWorm"
    ],
    "content": "\nThe BookWorm Digital Library project allowed me to engage with the potential of digital libraries and how they can promote learning and accessibility.\n\n## Introduction\n\nIn this section, I examine the process of transforming theoretical concept into practical solution through the experience of creating BookWorm.\n\n## Outline\n\n-   Problem: Limited access to books and educational material for people in remote areas.\n\n-   Solution: \"BookWorm Digital Library\" - an online platform offering an extensive collection of digital books, audio, and more for exploration and borrowing.\n\n-   Difficulties: Creating an intuitive and responsive UI that encourages exploration and ease of book borrowing. Managing large and diverse data sets with Firebase.\n\n-   Overcome: Leveraging Angular with Material-UI for a responsive and intuitive UI, and Firebase for effective data management and real-time updates.\n\n-   Conclusion: The \"BookWorm Digital Library\" project showcases the power of digital tools in promoting learning, reinforcing the importance of accessibility in digital platforms.\n",
    "slug": "bookworm-digital-library",
    "tech": [
      "angular",
      "firebase",
      "material-ui",
      "typescript",
      "nodejs"
    ]
  },
  {
    "name": "FoodFind Restaurant Locator",
    "description": "Search, discover, and review local dining options in your city",
    "coverImageUrl": "http://image.com/foodfind",
    "tags": [
      "vuejs",
      "ssr",
      "mongodb",
      "express",
      "vuetify",
      "nodejs",
      "typescript"
    ],
    "caseStudyUrl": "link to article on FoodFind project",
    "related": [
      "array",
      "of related",
      "articles",
      "about FoodFind"
    ],
    "content": "\nThis project was a wonderful opportunity to put into practice my favorite tech stack and to contribute to the growing food and restaurant discovery market.\n\n## Introduction\n\nThe following section delineates the journey of tackling a common problem experienced by food enthusiasts and contributing an effective solution.\n\n## Outline\n\n-   Problem: Users find it difficult to discover local restaurants and authenticate the reliability of the reviews.\n\n-   Solution: \"FoodFind\" provides a user-friendly interface to search, discover, and review local dining options.\n\n-   Difficulties: Dealing with a large data set of restaurants and ensuring seamless integration with the MongoDB server.\n\n-   Overcome: Efficient data modeling, effective use of Express.js for server-side operations, and implementing Vue.js for a smooth UI/UX.\n\n-   Conclusion: \"FoodFind\" has made the process of food discovery comprehensive and enjoyable. Receiving positive feedback from users has been an incredible reward.\n",
    "slug": "foodfind-restaurant-locator",
    "tech": [
      "vuejs",
      "ssr",
      "mongodb",
      "express",
      "vuetify",
      "nodejs",
      "typescript"
    ]
  },
  {
    "name": "playQ Videogame Playlist Manager",
    "description": "Create and share playlists to keep track of what you have been playing",
    "coverImageUrl": "http://image.com",
    "tags": [
      "react",
      "ssr",
      "postgres",
      "remix",
      "supabase",
      "hono",
      "nodejs",
      "typescript"
    ],
    "caseStudyUrl": "link to article on this project",
    "related": [
      "array",
      "of related",
      "articles"
    ],
    "content": "\nThis is a sample project file, where I can write about projects I have completed. It is super important to remember that I am working hard on presenting this data well, and to be employable.\n\n## Introduction\n\nThe first step is a strong introduction.\n\n## Outline\n\n-   Problem\n-   Solution\n-   Difficulties\n-   Overcome\n-   Conclusion\n",
    "slug": "playq-videogame-playlist-manager",
    "tech": [
      "react",
      "ssr",
      "postgres",
      "remix",
      "supabase",
      "hono",
      "nodejs",
      "typescript"
    ]
  }
]